astb_relise/src/Catalogs/Инструктажи/Инструктажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Инструктажи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидИнструктажа</name>
    <type>
      <types>EnumRef.ВидыИнструктажей</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйИнструктаж</name>
    <type>
      <types>CatalogRef.Инструктажи</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность по-умолчанию</comment>
    <type>
      <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

astb_relise/src/InformationRegisters/ПриказыНаИнструктажи/ПриказыНаИнструктажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриказыНаИнструктажи</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Проводить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструктаж</name>
    <type>
      <types>CatalogRef.Инструктажи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ИнструктажиСотрудников/ИнструктажиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнструктажиСотрудников</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаИнструктажа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструктаж</name>
    <type>
      <types>CatalogRef.Инструктажи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ВидыИнструктажей/ВидыИнструктажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИнструктажей</name>
  <enumValues>
    <name>Вводный</name>
  </enumValues>
  <enumValues>
    <name>Первичный</name>
  </enumValues>
  <enumValues>
    <name>Повторный</name>
  </enumValues>
  <enumValues>
    <name>Внеплановый</name>
  </enumValues>
  <enumValues>
    <name>Целевой</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Catalogs/Инструктажи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЕстьСсылкиВРегистрах() Тогда
			ЭтаФорма.ТолькоПросмотр = ИСТИНА;
			Элементы.ГруппаПредупреждение.Видимость = Истина;
		Иначе
			Элементы.ГруппаПредупреждение.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ЕстьСсылкиВРегистрах()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриказыНаИнструктажи.Инструктаж КАК Инструктаж
	|ИЗ
	|	РегистрСведений.ПриказыНаИнструктажи КАК ПриказыНаИнструктажи
	|ГДЕ
	|	ПриказыНаИнструктажи.Инструктаж = &Инструктаж
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнструктажиСотрудников.Инструктаж
	|ИЗ
	|	РегистрСведений.ИнструктажиСотрудников КАК ИнструктажиСотрудников
	|ГДЕ
	|	ИнструктажиСотрудников.Инструктаж = &Инструктаж";
	
	Запрос.УстановитьПараметр("Инструктаж",Объект.Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.ВидИнструктажа = Перечисления.ВидыИнструктажей.Повторный Тогда
		
		Элементы.ГруппаДляПовторногоИнструктажа.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаДляПовторногоИнструктажа.Видимость = Ложь;
		
	КонецЕсли;
	    	
КонецПроцедуры	

&НаКлиенте
Процедура ПервичныйИнструктажПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйИнструктажНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("Отбор",              Новый Структура("ВидИнструктажа", ПредопределенноеЗначение("Перечисление.ВидыИнструктажей.Первичный")));
	
	ОткрытьФорму("Справочник.Инструктажи.Форма.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Инструктажи.Форма.ФормаВыбора" Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			
			Объект.ПервичныйИнструктаж = ВыбранноеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИнструктажаПриИзменении(Элемент)
	
	ВидИнструктажаПриИзмененииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ВидИнструктажаПриИзмененииНаСервере()
	
	Если НЕ Объект.ВидИнструктажа = Перечисления.ВидыИнструктажей.Повторный Тогда
		Объект.ПервичныйИнструктаж 	= Справочники.Инструктажи.ПустаяСсылка();
		Объект.Периодичность 		= Справочники.ПериодичностьВыдачиСИЗ.ПустаяСсылка();
	КонецЕсли;	
	
	УстановитьВидимостьЭлементов();

КонецПроцедуры
